# password = input('Enter your password: ')
# print(password)

a = 1
b = 5
print(a + b)  # 6
a = 2
print(a)
a = 'Hello'
print(a)
c = 0
c = 1
message = ''
message = 'hello'


# имя переменной

# 1. Разрешен только один символ: _
_ = 123

# 2. 
a1 = 10
# 1a - error - нельза начинать с цифры


# X = 1  # можно называть с большой буквы, но не принято
# print(x)

ы = 123
print(ы)  # можно, но не принято

WIDTH = 1500  # переменная заранее известна и не будет изменяться

user_name = 'Vasya' # snake_case
userAge = 15  # camelCase


# homework
'''
1. Для чего в программировании нужна переменная?
2. Какие ты знаешь ограничения для имен переменных? 
3. Можно ли называть переменные русскими символами?
4. Может ли имя переменной начинаться с заглавной буквы?
'''

