print("Hello")  # Hello


print(1 + 2)  # 3
print(10 - 5)  # 5
print(2 * 3)  # 6
print(10 / 3)  # 3.3333333333333335
print(10 // 3)   # целое число при делении
print(10 % 3)  # остаток при делении
print(2 ** 3)  # 1 * 2 * 2 * 2 - возведение в степень
print(1 > 0)  # True
print(1 < 0)  # False
print(1 >= 0)  # True
print(0 >= 0)  # True
print(-10 >= 0)  # False
print(1 <= 5)  # True
print(1 == 1)  # True
print(1 != 0)  # True
print(not False)  # True
print(not True)  # False
print('Hello' + "World")  # HelloWorld - конкатенация


# calculator
print(eval(input(': ')))


# homework
'''
1. Вычислить следующие выражения при помощи Python:

10 умножить на 50 и разделить на 5
2 плюс 2 умножить на 2
Получить целое число при делении 3 на 2
Получить остаток при делении 3 на 2
2 в квадрате


2. Проверить себя при решении следующих задач. Быть готовым обосновать результаты.

10 + 20 - 25 >= 15  #  
3**2 <= 10
15 % 4 > 3
10 // 3 < 10 / 3
'''
print()